src/lambdas/rest/transactions/reverse/transfer-test/_mockChargeResult1.json

{
  "id": "ch_1DM0l7CM9MOvFvZKSRBB1w4y",
  "object": "charge",
  "amount": 75,
  "amount_refunded": 0,
  "application": "ca_Bg3hpStH7AImYbs5sSfGH06jTMS0Krwl",
  "application_fee": null,
  "balance_transaction": "txn_1DM0l7CM9MOvFvZKTUIEamce",
  "captured": true,
  "created": 1539727885,
  "currency": "usd",
  "customer": null,
  "description": null,
  "destination": null,
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {},
  "invoice": null,
  "livemode": false,
  "metadata": {
    "lightrailTransactionId": "a36f287d-5329-4b35-9",
    "lightrailTransactionSources": "[{\"rail\":\"lightrail\",\"valueId\":\"6b5288cc-8f3b-4122-b\"}]",
    "lightrailUserId": "default-test-user-TEST"
  },
  "on_behalf_of": null,
  "order": null,
  "outcome": {
    "network_status": "approved_by_network",
    "reason": null,
    "risk_level": "normal",
    "risk_score": 25,
    "seller_message": "Payment complete.",
    "type": "authorized"
  },
  "paid": true,
  "payment_intent": null,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges/ch_1DM0l7CM9MOvFvZKSRBB1w4y/refunds"
  },
  "review": null,
  "shipping": null,
  "source": {
    "id": "card_1DM0l7CM9MOvFvZK6i4qqIoH",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": null,
    "cvc_check": null,
    "dynamic_last4": null,
    "exp_month": 10,
    "exp_year": 2019,
    "fingerprint": "MJvnjqDtkyMS9aLA",
    "funding": "credit",
    "last4": "4242",
    "metadata": {},
    "name": null,
    "tokenization_method": null
  },
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_group": null
}