src/lambdas/rest/transactions/reverse/transfer-test/_mockRefundResult1.json

{
  "id": "re_1DM0l8CM9MOvFvZKKUhiHkUx",
  "object": "refund",
  "amount": 75,
  "balance_transaction": "txn_1DM0l8CM9MOvFvZKsundyXCA",
  "charge": "ch_1DM0l7CM9MOvFvZKSRBB1w4y",
  "created": 1539727886,
  "currency": "usd",
  "metadata": {
    "reason": "not specified"
  },
  "reason": null,
  "receipt_number": null,
  "source_transfer_reversal": null,
  "status": "succeeded"
}